Revit 2027 API
ExternalResourceLoadData.GetExternalResourceReference Method
 Returns the ExternalResourceReference that identifies which resource should be loaded.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExternalResourceReference GetExternalResourceReference()
Public Function GetExternalResourceReference As ExternalResourceReference
public:
ExternalResourceReference^ GetExternalResourceReference()
member GetExternalResourceReference : unit -> ExternalResourceReference
Return Value
ExternalResourceReference
Remarks
 Information in this object tells the server from which specific resource Revit expects to receive the external data.
See Also
Reference
ExternalResourceLoadData Class
Autodesk.Revit.DB Namespace